Котельников_АБ_70153995/src/Catalogs/ПрофилиДолжностей/ПрофилиДолжностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрофилиДолжностей</name>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДолжности</name>
    <type>
      <types>EnumRef.КатегорииДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПодразделения</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Образование</name>
    <type>
      <types>EnumRef.УровниОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОпытРаботы</name>
    <type>
      <types>EnumRef.ОпытРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностныеОбязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Требования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Условия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятости</name>
    <type>
      <types>EnumRef.ТипыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>EnumRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматРаботы</name>
    <type>
      <types>EnumRef.ФорматыРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаТрудаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаТрудаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоВычетаНалога</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПрофессиональныеНавыки</name>
    <attributes>
      <name>Навык</name>
      <type>
        <types>CatalogRef.ПрофессиональныеНавыки</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньВладения</name>
      <type>
        <types>EnumRef.УровниПрофессиональныхНавыков</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛичныеКачества</name>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.ЛичныеКачества</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗнанияЯзыков</name>
    <attributes>
      <name>Язык</name>
      <type>
        <types>CatalogRef.Языки</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньВладения</name>
      <type>
        <types>EnumRef.УровниЗнанийЯзыков</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Котельников_АБ_70153995/src/InformationRegisters/ЗарплатыПоДолжностям/ЗарплатыПоДолжностям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗарплатыПоДолжностям</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ЗарплатаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарплатаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Котельников_АБ_70153995/src/Enums/УровниЗнанийЯзыков/УровниЗнанийЯзыков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УровниЗнанийЯзыков</name>
  <enumValues>
    <name>Начальный</name>
  </enumValues>
  <enumValues>
    <name>Элементарный</name>
  </enumValues>
  <enumValues>
    <name>Средний</name>
  </enumValues>
  <enumValues>
    <name>СреднеПродвинутый</name>
  </enumValues>
  <enumValues>
    <name>Продвинутый</name>
  </enumValues>
  <enumValues>
    <name>ВСовершенстве</name>
  </enumValues>
  <enumValues>
    <name>Родной</name>
  </enumValues>
</mdclass:Enum>

Котельников_АБ_70153995/src/Catalogs/ПрофилиДолжностей/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ДанныеРуководителя = ПолучитьДанныеРуководителя();
		Объект.Подразделение = ДанныеРуководителя.Подразделение;
		Объект.РуководительПодразделения = ДанныеРуководителя.Сотрудник;
		ДобавитьЯзыкПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеРуководителя()

	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Сотрудник КАК Сотрудник,
		|	Пользователи.Сотрудник.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Возврат Выборка;
	
КонецФункции

&НаСервере
Процедура ДобавитьЯзыкПоУмолчанию()

	СтрокаТЧ = Объект.ЗнанияЯзыков.Добавить();
	СтрокаТЧ.Язык = Справочники.Языки.РусскийЯзык;
	СтрокаТЧ.УровеньВладения = Перечисления.УровниЗнанийЯзыков.Родной;

КонецПроцедуры

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	
	Если НЕ (Объект.Подразделение.Пустая() ИЛИ Объект.Должность.Пустая()) Тогда
		Зарплата = ПолучитьЗарплату(Объект.Подразделение, Объект.Должность);
		Объект.ОплатаТрудаОт = Зарплата.ЗарплатаОт;
		Объект.ОплатаТрудаДо = Зарплата.ЗарплатаДо; 
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗарплату(Подразделение, Должность)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Подразделение", Подразделение);
	ПараметрыОтбора.Вставить("Должность", Должность);
	
	Зарплата = РегистрыСведений.ЗарплатыПоДолжностям.ПолучитьПоследнее(, ПараметрыОтбора);
	
	Возврат Зарплата;
			
КонецФункции
